; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v2 ?v3)
             (pred_7 ?v12 ?v6)
             (pred_2 ?v2 ?v6)
             (pred_3 ?v10 ?v2 )
	     (pred_8 ?v2)
             (pred_6 ?v1)
             (pred_12 ?v12)
             (pred_4 ?v6)
             (pred_1 ?v2)
             (pred_10 ?v12)
             (pred_9 ?v2)
             (pred_5 ))



(:action op_3
:parameters (?v13 ?v7 ?v5 ?v11)
:precondition (and (pred_6 ?v13) (pred_6 ?v7) (pred_12 ?v5) (pred_4 ?v11)
          (pred_11 ?v13 ?v7) (pred_7 ?v5 ?v11)
                   (pred_2 ?v7 ?v11) (pred_8 ?v13) 
                   (pred_1 ?v7) (pred_10 ?v5))
:effect (and  (pred_9 ?v7) (not (pred_1 ?v7))))


(:action op_2
:parameters (?v13 ?v4)
:precondition (and (pred_6 ?v13) (pred_6 ?v4)
               (pred_8 ?v13) (pred_11 ?v13 ?v4) (pred_9 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v13))))

(:action op_1
:parameters (?v13 ?v5)
:precondition (and (pred_6 ?v13) (pred_12 ?v5) 
                  (pred_8 ?v13) (pred_3 ?v5 ?v13) (pred_5 ))
:effect (and (pred_10 ?v5)
   (not (pred_3 ?v5 ?v13)) (not (pred_5 ))))


(:action op_5
:parameters (?v13 ?v9 ?v8)
:precondition (and (pred_6 ?v13) (pred_12 ?v9) (pred_12 ?v8)
                  (pred_8 ?v13) (pred_10 ?v8) (pred_3 ?v9 ?v13))
:effect (and (pred_10 ?v9) (pred_3 ?v8 ?v13)
        (not (pred_10 ?v8)) (not (pred_3 ?v9 ?v13))))

(:action op_4
:parameters (?v13 ?v5)
:precondition (and (pred_6 ?v13) (pred_12 ?v5) 
                  (pred_8 ?v13) (pred_10 ?v5))
:effect (and (pred_5 ) (pred_3 ?v5 ?v13) (not (pred_10 ?v5)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_06 obj_02 obj_12 obj_07 obj_03 obj_01 obj_09 obj_08
    obj_10 obj_05
    obj_13 obj_04
    )

    (:init
       (pred_5)

       (pred_6 obj_11)
       (pred_6 obj_06)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_07)
       (pred_6 obj_03)
       (pred_6 obj_01)
       (pred_6 obj_09)
       (pred_6 obj_08)
       (pred_4 obj_10)
       (pred_4 obj_05)
       (pred_12 obj_13)
       (pred_12 obj_04)

       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_06 obj_02)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_02 obj_03)
       (pred_11 obj_02 obj_06)
       (pred_11 obj_12 obj_01)
       (pred_11 obj_12 obj_07)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_07 obj_09)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_07 obj_12)
       (pred_11 obj_03 obj_08)
       (pred_11 obj_03 obj_02)
       (pred_11 obj_03 obj_07)
       (pred_11 obj_01 obj_09)
       (pred_11 obj_01 obj_12)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_09 obj_07)
       (pred_11 obj_09 obj_01)
       (pred_11 obj_08 obj_03)
       (pred_11 obj_08 obj_09)
       (pred_1 obj_08)
       (pred_1 obj_11)
       (pred_2  obj_08 obj_10)
       (pred_2  obj_11 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_02)
       (pred_9 obj_12)
       (pred_9 obj_07)
       (pred_9 obj_03)
       (pred_9 obj_01)
       (pred_9 obj_09)

       (pred_7  obj_13 obj_10)
       (pred_7  obj_04 obj_05)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_04 obj_02)
       (pred_8 obj_02)
    )

    (:goal (and
       (pred_3 obj_04 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_06)))
)
)

; plan
1. (op_1 obj_02 obj_04)
   deleted: (pred_3 obj_04 obj_02) (pred_5)
   added: (pred_10 obj_04)
   goals met: 0 of 1
2. (op_2 obj_02 obj_03)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_03)
   goals met: 0 of 1
3. (op_2 obj_03 obj_07)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_07)
   goals met: 0 of 1
4. (op_2 obj_07 obj_12)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_12)
   goals met: 0 of 1
5. (op_3 obj_12 obj_11 obj_04 obj_05)
   deleted: (pred_1 obj_11)
   added: (pred_9 obj_11)
   goals met: 0 of 1
6. (op_2 obj_12 obj_11)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_11)
   goals met: 0 of 1
7. (op_4 obj_11 obj_04)
   deleted: (pred_10 obj_04)
   added: (pred_5) (pred_3 obj_04 obj_11)
   goals met: 1 of 1
